{"_id":"57dc2166909082fc278670dd","createDate":"2016-09-16T16:44:22.515Z","createUserId":"55e5c6995a761f8a46b34399","ownerType":1,"ownerId":"57dc20bf909082fc278670dc","against":false,"threadId":null,"parentId":null,"ethicalStatus":{"hasValue":false},"typeId":1,"editDate":"2016-09-16T16:44:22.515Z","editUserId":"55e5c6995a761f8a46b34399","references":"<p><a href=\"https://www.facebook.com/notes/ptv/soj-statement-on-the-september-15-2016-senate-committee-on-justice-hearing-on-ex/1307814249279242\">https://www.facebook.com/notes/ptv/soj-statement-on-the-september-15-2016-senate-committee-on-justice-hearing-on-ex/1307814249279242</a></p>","title":"SOJ STATEMENT ON THE SEPTEMBER 15, 2016 Senate Committee on Justice Hearing on Extrajudicial Killings","content":"<div>“The statement of witness Edgar Matobato today before the Senate Committee on Justice Hearing on Extrajudicial Killings are lies and fabrications. It can only be the product of a fertile and a coached imagination.”, Justice Aguirre said on the on-going Justice Committee Hearing in the Senate on Extra-Judicial Killing chaired by Senator Leila De Lima.</div><div><br></div><div>“Mr. Matobato stated that he did not execute an affidavit containing what he stated before the Senate hearing today. How can that be possible? He stated that he was under the witness protection program before. One cannot be part of the WPP without executing an affidavit. He is obviously not telling the truth. Can he be trusted?”, Secretary Aguirre stated.</div><div><br></div><div>“How is it possible that he could just arrive at the Senate without him being invited or without him knowing that there is a Senate inquiry today. How can he not name who brought him to the Senate? Who is he protecting? It is just a simple question that he cannot answer. Something is not right. How can you believe him?”, Justice Secretary Aguirre added.</div><div><br></div><div>“I personally know what happened to the case of Benjamin Laud since 2009 because I lawyered for him. I was there when the Commission on Human Rights, then headed by Senator De Lima, ordered the bodies of the alleged victims of extra-judicial killings to be exhumed at Laud’s firing range in Maa, Davao. The bodies did not prove anything. As a matter of fact, there were statements that they were bodies of people who were executed during the Japanese occupation.”, Secretary Aguirre further stated.</div><div><br></div><div>“Also, think about this, Senator De Lima headed both the CHR and the Department of Justice, why was it that there was no case filed against Mayor Duterte? Senator De Lima had more than six (6) years to file any case she deems worthy to filed. The question that begs asking is WHY INVESTIGATE ONLY NOW? Why only now when there will be a coming House of Representatives’ hearing on why drugs proliferated in the Bureau of Corrections? Who was heading the DOJ during that time? The Bureau of Corrections was under the DOJ. This is a futile attempt to divert the public’s attention against the parties who are responsible for drugs in the BuCor. DESPERATE TIMES CALL FOR DESPEARATE MEASURES AND SOMEBODY IS REALLY DESPERATE! I invite everyone to watch the House of Representative’s Committee on Justice Hearing on the Proliferation of Drugs at our penitentiaries so all will know the motivation behind the statements against Mayor Duterte in today’s Senate hearing”, added Secretary Aguirre.</div><div><br></div><div>---END---</div>","childrenCount":{"issues":0,"questions":0,"opinions":0,"arguments":0},"private":false,"tags":[],"screeningStatus":0,"screening":{"status":1,"history":[]}}